[
    {
        "title": "Amazon layoffs now expected to mount to 20,000, including top managers",
        "content": "Amazon plans to lay off as many as 20,000 employees across the company in the coming months, including  distribution center workers, technology staff and corporate executives—about twice as many as previously reported—as the retail and cloud computing giant retrenches after going on a hiring spree during the pandemic. Amazon employees are ranked from level 1 to level 7, and staff at all levels will likely be affected, according to sources with direct knowledge of the matter, who requested anonymity. The New York Times first reported in mid-November that Amazon would enact mass layoffs, citing sources that said that as many as 10,000 people would be laid off.",
        "user_id": 1
    },
    {
        "title": "I accidentally created artificial intelligence in my Minecraft world",
        "content": "I have been building Minecraft mega structures for 4 years now. Constructing some monumental pieces that would have completely destroyed my first pc build into straight ashes. I built entire neighborhoods, Disney Land, Mordor, the Eifel tower and 16 neighborhoods of Paris in every direction. There was the 4 months I spent hunched over my screen for the Great Wall. And my recreation of the Universe. Stars, galaxies swirling in the distance, that were so large I had to compress them with a mod in order to get them to fit in a block, and then another mod on top of that one to load said block like a new world when I touched it so that it didn't lag me out trying to render.",
        "user_id": 2
    },
    {
        "title": "Is there any legitimate reasons for the javascript hate?",
        "content": "I noticed a lot of people (particularly r/programmerhumor) act like javascript is the absolute worst programming language in existence. I actually quite like javascript, and enjoy it not being type sensitive because it makes programming in it faster.\nIt seems like a lot of the reasons people hate on javascript is things like Oh my god you can add a function and a string together and it doesn't crash everything! but, how often does that actually come up? For me, literally never. To me, javascript has always just felt like C but a lot more free-flow.\nI can't think of a single time I have ever had problems were I was like, wait how did I end up getting a string here when I expected an integer? it seems like a lot of the time, it just comes down to people needing to keep better track of what they are doing. https://github.com/denysdovhan/wtfjs I have seen this cited as a reason why javascript is so bad, but it seems like everything on there would come down to the error of the programmer, how would you even end up in situations were these would come up?I'm not blindly defending javascript though, I just want to know legitminate reasons why it is bad, not random OHHH I added function and string and it didn' t crash! And hey, for all I know, maybe I am just use to the jankiness and there is a lot of weird stuff. That's why I'm curious to know. \n edit: Ok, I see. Basically, programmerhumor is a joke sub, no point in taking it too seriously. Javascript does have quite a bit of jankiness, and yeah, a lot of it just me being so use to the jank. At the end of the day though, use what works best for you. Thanks everyone for the great discussion.",
        "user_id": 3
    },
    {
        "title": "Cooler Master ORB X Gaming Pod, Might be Coolest Workstation Ever",
        "content": "The Cooler Master ORB X gaming pod just might be the coolest yet, and would perfectly complement this Project A.R.E.S. system. Its designed to combine luxury and technology into something that offers a whole new level of immersion as well as comfort with a semi-enclosed design.\nNot just throne-shaped workstation, it boasts a fully automated motorized shuttle dome to keep distractions out and enable an uninterrupted privacy mode. You can either configure it with a single 34-inch monitor or three 27-inch monitors, while surround sound speakers are directly housed in the station itself. An ergonomic recliner offers an adjustable headrest, lumbar support, and leg rest. You can get on the waitlist now for one, but pricing or availability has not yet been announced.",
        "user_id": 4
    },
    {
        "title": "qwertyuiop5",
        "content": "qwertyuiop5",
        "user_id": 5
    }
]